_posts/2016-10-18-getting-started-with-docker.html
---
layout:     post
title:      Getting Started with Docker
date:       2016-10-18
summary: Docker is an open platform for developing, shipping, and running applications.
tags: [docker]
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-10-28 Fri 05:33 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Getting Started with Docker</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Dashamir Hoxha" />
</head>
<body>
<div id="content">
<h1 class="title">Getting Started with Docker</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. What is Docker</a></li>
<li><a href="#orgheadline2">2. Install and test</a></li>
<li><a href="#orgheadline3">3. Run a command in a docker container</a></li>
<li><a href="#orgheadline4">4. Create a web application container</a></li>
<li><a href="#orgheadline5">5. Other docker commands</a></li>
<li><a href="#orgheadline6">6. A real world example</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> What is Docker</h2>
<div class="outline-text-2" id="text-1">
<p>
Docker is an open platform for developing, shipping, and running
applications.
<a href="https://docker.github.io/engine/understanding-docker/">https://docker.github.io/engine/understanding-docker/</a>
</p>

<ul class="org-ul">
<li>What it can be used for
<ul class="org-ul">
<li>Fast, consistent delivery of applications</li>
<li>Responsive deployment and scaling</li>
<li>Running more workloads on the same hardware</li>
</ul></li>

<li>Its architecture
<ul class="org-ul">
<li>Daemon</li>
<li>CLI and API</li>
<li>Images</li>
<li>Containers</li>
<li>Registries (Docker Hub)</li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Install and test</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><p>
Install:
From <a href="https://docker.github.io/engine/getstarted/linux_install_help/">https://docker.github.io/engine/getstarted/linux_install_help/</a>
</p>
<pre class="example">
curl -fsSL https://get.docker.com/ | sh
</pre></li>

<li><p>
Verify installation:
</p>
<pre class="example">
docker version
docker run hello-world
</pre></li>

<li><p>
Check containers and images:
</p>
<pre class="example">
docker ps -a
docker images
</pre></li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> Run a command in a docker container</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li><p>
Hello world:
</p>
<pre class="example">
docker run ubuntu:14.04 /bin/echo 'Hello world'
</pre></li>

<li><p>
An interactive container:
</p>
<pre class="example">
docker run -t -i ubuntu:14.04 /bin/bash
pwd
ls
exit
</pre></li>

<li><p>
A daemonized hello world:
</p>
<pre class="example">
docker run -d ubuntu:14.04 \
    /bin/sh -c "while true; do echo hello world; sleep 1; done"
docker ps
docker logs -f &lt;name-of-container&gt;
docker stop &lt;name-of-container&gt;
docker ps -a
docker rm &lt;name-of-container&gt;
</pre></li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> Create a web application container</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><p>
Create a new container from <b>ubuntu-upstart</b>:
</p>
<pre class="example">
docker run -d --name=webapp --hostname=example.org \
           -p 80:80 ubuntu-upstart:14.04
</pre></li>

<li><p>
Update system packages of the container:
</p>
<pre class="example">
alias docker-webapp-exec='docker exec -it webapp env TERM=xterm'
docker-webapp-exec bash
apt-get update
apt-get -y upgrade
</pre></li>

<li><p>
Install apache2 and mysql:
</p>
<pre class="example">
apt-get install apache2 mysql-server php5 php5-mysql
</pre></li>

<li><p>
Create a test app:
</p>
<pre class="example">
cd /var/www/html/
apt-get install vim
vim index.php
exit
</pre></li>

<li><p>
Add this line on <code>/etc/hosts</code>.
</p>
<pre class="example">
127.0.0.1 example.org
</pre></li>

<li>Try it in browser: <a href="http://example.org/">http://example.org/</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">5</span> Other docker commands</h2>
<div class="outline-text-2" id="text-5">
<pre class="example">
docker
docker inspect
docker inspect --help
docker inspect ubuntu-upstart:14.04
docker inspect webapp
docker inspect -f '{{ .NetworkSettings.IPAddress }}' webapp
docker top webapp
</pre>
</div>
</div>


<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">6</span> A real world example</h2>
<div class="outline-text-2" id="text-6">
<p>
Let's see how Docker is used by installing a B-Translator Client:
<a href="http://info.btranslator.org/install.html">http://info.btranslator.org/install.html</a>
</p>

<ul class="org-ul">
<li><p>
Get the image:
</p>
<pre class="example">
docker search btranslator
docker pull btranslator/btr_client:v3.0
docker images
</pre></li>

<li><p>
Create and start a container:
</p>
<pre class="example">
docker create --name=btr_client --hostname=example.org \
    -p 443:443 --restart=always \
    btranslator/btr_client:v3.0
docker ps
docker ps -a
docker start btr_client
</pre></li>

<li><p>
Add this line on <code>/etc/hosts</code>.
</p>
<pre class="example">
127.0.0.1 fr.example.org
</pre></li>

<li>Open in browser: <a href="https://fr.example.org/">https://fr.example.org/</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2016-10-18</p>
<p class="author">Author: Dashamir Hoxha</p>
<p class="date">Created: 2016-10-28 Fri 05:33</p>
<p class="validation"></p>
</div>
</body>
</html>
